[
  {
    "id": "0xAf8888f666D0432e6445bB728775bB3BEC4028d4",
    "title": "Story Starts Here",
    "artist": "Adwait Keshari",
    "description": "This is a playful, Gen-Z-inspired anthem I wrote and produced during the Story Protocol Hackathon. It’s a lyrical take on the serious issue of intellectual property protection — turning complex legal concepts into something danceable, fun, and super relatable.\r\n\r\nFrom music and comics to AI-generated content, creators today face constant challenges around ownership and rights. This song tells that story how Story Protocol helps you lock your work on-chain, set your terms, and get paid instantly when it’s used or remixed.\r\n\r\nWhether you're dropping a beat or minting an idea, Story Protocol empowers you to protect what’s yours with clarity, transparency, and vibes.\r\n\r\nLyrics, idea, and flow all created by me as part of this hackathon project. ",
    "price": "9.999",
    "audioUrl": "https://ipfs.io/ipfs/QmXKjtCREnoiUPyePwWjxvxbZrmhfVYpGZkT8iWqu1qguk",
    "imageUrl": "https://ipfs.io/ipfs/QmXvrGiHuSPDmUq9tHx41ZcGd467GHNpPYdKmo9Lgbaxbb",
    "owner": "0x3efffd7cacbfdd00f05a370ed57a8977d1c7070c",
    "metadataUrl": "https://ipfs.io/ipfs/QmYE68MNVLhXMKKQEXo7yWr3PWzaVHCw86YkB2zDZediNZ",
    "createdAt": "2025-06-23T15:38:51.220Z",
    "ipId": "0xAf8888f666D0432e6445bB728775bB3BEC4028d4",
    "txHash": "0xd640460b870bf4fb0ccbccc8daaf3ed85c977b28849a366826ad05bedb8978a2"
  },
  {
    "id": "0x0e93269288E72B8013F0f37E859A0c1b4f433e46",
    "title": "Tell Me a Story (And Pay Me Right)",
    "artist": "Adwait Keshari",
    "description": "🎶 Project Title: “Tell Me a Story (And Pay Me Right)”\r\n\r\nCreated during the Story Protocol Hackathon, this project is a musical anthem for a new era of digital ownership. It captures the struggle of creators in a world where IP is often stolen or ignored and how Story Protocol flips the script.\r\n\r\n“Story Starts Here” is more than a song. It’s a movement. With playful, Gen-Z-inspired lyrics and bouncy, danceable energy, it breaks down complex ideas like licensing, smart contracts, and remix royalties into something vibey, accessible, and unforgettable.\r\n\r\nFrom AI art and beats to comics and code this track celebrates every creator’s right to protect their work from Day 1.\r\nPut it on-chain. Lock it with rules. Get your cut. No lawyers. No waiting. Just vibes and ownership.\r\n\r\nEverything—lyrics, concept, voice—crafted by me.\r\nBecause every great story deserves to start in the right hands.",
    "price": "10",
    "audioUrl": "https://ipfs.io/ipfs/QmeoktUj1TRtUq6N6XEK76CpuTkZXvvbEB22XVjZGn3nci",
    "imageUrl": "https://ipfs.io/ipfs/QmSgtE8K8epoDpg5iCVNeZXaE9c7ExwCRz1YFsjEpRWja5",
    "owner": "0x3efffd7cacbfdd00f05a370ed57a8977d1c7070c",
    "metadataUrl": "https://ipfs.io/ipfs/QmWp2UoBASBzP4KMpPPsFZ7pCTMMbhPbcqytDqyUpXA53i",
    "createdAt": "2025-06-23T15:50:11.325Z",
    "ipId": "0x0e93269288E72B8013F0f37E859A0c1b4f433e46",
    "txHash": "0xf49bdfd183a34343c4b7d9721132244a785e308ebc0a1372ee31e490c161c2dc"
  }
]